Revit 2027 API
PanelScheduleView.GetLoadClassificationConnectedCurrent Method
 Gets the Total Current for given Load Classification
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetLoadClassificationConnectedCurrent(
	int nRow,
	int nCol
)
Public Function GetLoadClassificationConnectedCurrent (
	nRow As Integer,
	nCol As Integer
) As String
public:
String^ GetLoadClassificationConnectedCurrent(
	int nRow,
	int nCol
)
member GetLoadClassificationConnectedCurrent :
        nRow : int *
        nCol : int -> string
Parameters
nRow Int32
 Row number of Load Summary Section
nCol Int32
 Column number of Load Summary Section
Return Value
String
 The Connected Current for the given Load Classification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given row number nRow is invalid in Summary. -or- The given column number nCol is invalid in Summary.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace